requests/login.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
	<Body>
		<Login xmlns="urn:vim25">
			<_this type="SessionManager">SessionManager</_this>
			<userName>{0}</userName>
			<password>{1}</password>
			<locale>en_US</locale>
		</Login>
	</Body>
</Envelope>